package wellink.test.task.entities.supply_purchasing_department;

import wellink.test.task.super_classes.BaseEmployee;

/**
 * "Менеджер по закупкам и поставкам"
 *
 * Должностные обязанности:
 *
 *  - Управление ассортиментом в рамках закрепленной категории: формирование ассортиментной матрицы
 *
 *  - Управление товарными запасами, отслеживание остатков по всей сети
 *
 *  - Контроль: ценообразования, неликвида, оборачиваемости товара
 *
 *  - Работа с поставщиками: ведение переговоров, согласование договоров, оптимизация условий работы (цены, отсрочки, возврат и уценка неликвидов), контроль задолженности, размещение заказов
 *
 *  - Осуществление доставки от поставщиков, составление и контроль графика перемещений, работа с транспортными компаниями
 *
 *  - Инициирование маркетинговых мероприятий для продвижения товара и увеличения товарооборота
 *
 *  - Претензионная работа с поставщиками и транспортными компаниями
 */
public class PurchasingSupplyManager extends BaseEmployee {
    /*
            2. Должностные обязанности менеджера по закупкам

        Менеджер по закупкам выполняет следующие должностные обязанности:
        2.1. Обеспечивает наличие товара по своим товарным группам в оптимальном количестве и ассортименте.
        2.2. Обеспечивает плановые показатели по оборачиваемости своих товарных групп.
        2.3. Ведет поиск поставщиков, изучает новые предложения от поставщиков, готовит для руководства обоснованные предложения о привлечении новых поставщиков.
        2.4. Проводит переговоры с поставщиками и согласовывает условия поставки с непосредственным руководителем.
        2.5. Составляет заказы поставщикам.
        2.6. Отслеживает выполнение заказа.
        2.7. Контролирует исполнение обязательств перед поставщиками.
        2.8. Обеспечивает документальное оформление сделок.
        2.9. Отслеживает продажи по каждому товару и, в случае ухудшения продаж, совместно с отделом маркетинга вырабатывает и принимает меры к снижению товарного остатка.
        2.10. Определяет виды товара, которые необходимо внести в ассортимент или вывести из ассортимента ввиду бесперспективности.
        2.11. Определяет минимальный складской остаток товаров и обеспечивает наличие необходимого количества товара на складе компании.
        2.12. Обеспечивает постоянное наличие товаров повышенного спроса, регулярно производит мониторинг наличия и продаж по товарам повышенного спроса с целью недопущения появления их дефицита.
        2.13. Обеспечивает отделы и службы компании всей необходимой информацией о товарах.
        2.14. Консультирует продавцов, а при необходимости – покупателей по своей товарной группе.
        2.15. Выполняет отдельные служебные поручения своего непосредственного руководителя.
     */
}
